#1)  შექმენით ფუნქცია, რომელსაც გადაეცემა მთელი რიცხვების სია. თქვენი დავალებაა, რომ ამ სიის ლუწ ინდექსებზე მყოფი რიცხვების ჯამი დააბრუნოთ. აუცილებლად გამოიყენეთ return ამ და ასევე შემდეგ დავალებებში.
 

 

#2)შექმენით ფუნქცია, რომელსაც გადაეცემა მთელი რიცხვი. თქვენი დავალებაა, რომ დააბრუნოთ ლუწია თუ კენტი ის.
def even_or_odd(num):
    if num % 2 == 0:
        return ("Your number is even")
    else:
        return ("Your number is odd")
    
print(even_or_odd(int(input("Please enter your number: "))))
           

# 3) შექმენით ფუნქცია, რომელსაც გადაეცემა მთელი რიცხვების სია. შემდეგ გამოიყენეთ ციკლი, რათა განიხილოთ ამ სიის ყველა რიცხვი - თუ რიცხვი ლუწია, ახალ სიაში დაამატეთ მისი განაყოფი ორზე, ხოლო თუ კენტია, მაშინ რიცხვის ნამრავლი ორზე. საბოლოოდ დააბრუნეთ განახლებული სია/
def list():
    numbers = [1,2,3,4,5,6,7,8,9,10]
    nums = []
    for i in numbers:
        if i % 2 == 0:
            i //= 2
            nums.append(i)
            
        elif i % 2 != 0:
            i *= 2
            nums.append(i)
        return nums
        
print(list())
        