# 1. შექმენით ფუნქცია სახელად manual_reverse, რომელიც მიიღებს დალაგებულ კოლექციას. თქვენი დავალებაა, რომ შეაბრუნოთ ეს კოლექცია და დააბრუნოთ ამ სახით.
def manual_reverse(list):
     for i in list:
       return  list[::-1] 
          
    
print(manual_reverse(["Alexandre", "Gabrieli", "Nikolozi"]))

# 2) შექმენით ფუნქცია სახელად manual_replace, რომელიც მიიღებს სია, ჩასანაცლებელ ელემენტს და იმ ელემენტს, რომლითაც უნდა ჩანაცვლდეს. თქვენი დავალებაა, რომ დააბრუნოთ ახალი კოლექცია, სადაც გექნებათ ჩანაცვლებული ყველა ელემენტი მესამე პარამეტრით.
 